"""
    제작 시간 : 0313_12:16
    유형 : 과제
    주제 : Random.py에 적힌 알고리즘 코드를 가져와서 매개변수 조건을 통해 로또 시스템에 맞게 출력하는 역할
    문제 설명 : 
    - 로또의 조건
        - 1회 1,000원
        - 최소 횟수 : 5회 (5,000원)
        - 최대 횟수 : 20회 (100,000원)
        - 뽑기 범위 : 1~45
        - 겹치기 불가능
        - 뽑기 갯수 : 6개
    - 추가 조건
        - 한번 번호를 뽑을 떄마다 1,000회 랜덤 돌리기
        - Data.py를 통해 1000번 후에 뽑힌 번호들을 누적해서 나중에 십만, 백만번 뽑기 이후에 
        뽑기 확률을 보여주면서 확률의 공정성 검증하기
        - 랜덤 돌릴때마다 걸리는 시간 측정하기
"""

# 모듈
import sys
import Random.py


def main() -> None:
    
    
    # sys.stdout.write(\"\n\".join(out_lines))
    pass


if __name__ == "__main__":
    main()