#include <stdio.h>

int main()
{
    int a = 10; // 비트열 00000000 00000000 00000000 00001010
    int b = 12; // 비트열 00000000 00000000 00000000 00001100
    

    printf("a & b : %d\n", a & b); // AND 연산 00000000 00000000 00000000 00001000 -> 8
    printf("a | b : %d\n", a | b); // OR 연산   00000000 00000000 00000000 00001110 -> 14
    printf("a ^ b : %d\n", a ^ b); // XOR 연산 00000000 00000000 00000000 00000110 -> 6
    printf("~a : %d\n", ~a);       // NOT 연산 11111111 11111111 11111111 11110101 -> -11 (2의 보수)
    printf("a << 1 : %d\n", a << 1); // 왼쪽 시프트 연산 00000000 00000000 00000000 00010100 -> 20
    printf("a >> 2 : %d\n", a >> 2); // 오른쪽 시프트 연산 00000000 00000000 00000000 00000010 -> 2
    
    printf("\n");

    a=10;
    b=5;
    int res;
    
    res = a/b *2;
    printf("res : %d\n", res);
    res = ++a * 3;
    printf("res : %d\n", res);
    res = a>b && a!=5;
    printf("res : %d\n", res);
    res = a%3==0;
    printf("res : %d\n", res);

    return 0;
}